app/views/posts/_post.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <h2 class="card-title text-center mb-4"><%= post.title %></h2>
            <p class="card-text text-center">By: <%= post.user.email.split('@').first %></p>