app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_id" IS NULL  [["post_id", 14]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 4], ["id", 3]]
---
    <p>
        <%= render @post.comments.where(parent_id: nil).includes(:user)  %>