app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at", "parent_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "qwew"], ["post_id", 2], ["user_id", 1], ["created_at", "2024-03-04 11:25:18.962896"], ["updated_at", "2024-03-04 11:25:18.962896"], ["parent_id", nil]]
---
  def create
    @comment = @post.comments.new(comment_params)

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 14], ["id", 15], ["LIMIT", 1]]
---
  def update
    @comment = @post.comments.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def set_comment
    @comment = current_user.comments.find_by(id: params[:id])