app/controllers/posts_controller.rb

  def index
    @posts = Post.order(id: :desc).includes(:user).page(params[:page])
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC

  def show
    @post = Post.find(params[:id])
    @parent_comments = @post.comments.includes(:user, :likes).where(parent_id: nil).order(:created_at)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 4], ["id", 3]]

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "qwe"], ["description", "qwew"], ["created_at", "2024-03-04 11:23:41.717217"], ["updated_at", "2024-03-04 11:23:41.717217"], ["user_id", 1]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3

  def set_post
    @post = current_user.posts.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]